ChibiOS/ChibiOS-Contrib/os/hal/ports/GD/GD32VF103/TIM/hal_icu_lld.c
#if GD32_ICU_USE_TIM11
  /* Driver initialization.*/
  icuObjectInit(&ICUD11);
  ICUD11.tim = GD32_TIM11;
#endif

#if GD32_ICU_USE_TIM12
  /* Driver initialization.*/
  icuObjectInit(&ICUD12);
  ICUD12.tim = GD32_TIM12;
#endif

#if GD32_ICU_USE_TIM13
  /* Driver initialization.*/
  icuObjectInit(&ICUD13);
  ICUD13.tim = GD32_TIM13;
#endif

#if GD32_ICU_USE_TIM14
  /* Driver initialization.*/
  icuObjectInit(&ICUD14);
  ICUD14.tim = GD32_TIM14;
#endif

#if GD32_ICU_USE_TIM15
  /* Driver initialization.*/
  icuObjectInit(&ICUD15);
  ICUD15.tim = GD32_TIM15;
#endif

#if GD32_ICU_USE_TIM20
  /* Driver initialization.*/
  icuObjectInit(&ICUD20);
  ICUD20.tim = GD32_TIM20;
#endif

#if GD32_ICU_USE_TIM21
  /* Driver initialization.*/
  icuObjectInit(&ICUD21);
  ICUD21.tim = GD32_TIM21;
#endif

#if GD32_ICU_USE_TIM22
  /* Driver initialization.*/
  icuObjectInit(&ICUD22);
  ICUD22.tim = GD32_TIM22;
#endif
}

/**
 * @brief   Configures and activates the ICU peripheral.
 *
 * @param[in] icup      pointer to the @p ICUDriver object
 *
 * @notapi
 */
void icu_lld_start(ICUDriver *icup) {
  uint32_t psc;

  osalDbgAssert((icup->config->channel == ICU_CHANNEL_1) ||
                (icup->config->channel == ICU_CHANNEL_2),
                "invalid input");

  if (icup->state == ICU_STOP) {
    /* Clock activation and timer reset.*/
#if GD32_ICU_USE_TIM1
    if (&ICUD1 == icup) {
      rccEnableTIM1(true);
      rccResetTIM1();
#if !defined(GD32_TIM1_SUPPRESS_ISR)
      eclicEnableVector(GD32_TIM1_UP_NUMBER, GD32_ICU_TIM1_IRQ_PRIORITY, GD32_ICU_TIM1_IRQ_TRIGGER);
      eclicEnableVector(GD32_TIM1_CC_NUMBER, GD32_ICU_TIM1_IRQ_PRIORITY, GD32_ICU_TIM1_IRQ_TRIGGER);
#endif
#if defined(GD32_TIM1CLK)
      icup->clock = GD32_TIM1CLK;
#else
      icup->clock = GD32_TIMCLK2;
#endif
    }
#endif

#if GD32_ICU_USE_TIM2
    if (&ICUD2 == icup) {
      rccEnableTIM2(true);
      rccResetTIM2();
#if !defined(GD32_TIM2_SUPPRESS_ISR)
      eclicEnableVector(GD32_TIM2_NUMBER, GD32_ICU_TIM2_IRQ_PRIORITY, GD32_ICU_TIM2_IRQ_TRIGGER);
#endif
#if defined(GD32_TIM2CLK)
      icup->clock = GD32_TIM2CLK;
#else
      icup->clock = GD32_TIMCLK1;
#endif
    }
#endif

#if GD32_ICU_USE_TIM3
    if (&ICUD3 == icup) {
      rccEnableTIM3(true);
      rccResetTIM3();
#if !defined(GD32_TIM3_SUPPRESS_ISR)
      eclicEnableVector(GD32_TIM3_NUMBER, GD32_ICU_TIM3_IRQ_PRIORITY, GD32_ICU_TIM3_IRQ_TRIGGER);
#endif
#if defined(GD32_TIM3CLK)
      icup->clock = GD32_TIM3CLK;
#else
     icup->clock = GD32_TIMCLK1;
#endif
    }
#endif

#if GD32_ICU_USE_TIM4
    if (&ICUD4 == icup) {
      rccEnableTIM4(true);
      rccResetTIM4();
#if !defined(GD32_TIM4_SUPPRESS_ISR)
      eclicEnableVector(GD32_TIM4_NUMBER, GD32_ICU_TIM4_IRQ_PRIORITY, GD32_ICU_TIM4_IRQ_TRIGGER);
#endif
#if defined(GD32_TIM4CLK)
      icup->clock = GD32_TIM4CLK;
#else
      icup->clock = GD32_TIMCLK1;
#endif
    }
#endif

#if GD32_ICU_USE_TIM5
    if (&ICUD5 == icup) {
      rccEnableTIM5(true);
      rccResetTIM5();
#if !defined(GD32_TIM5_SUPPRESS_ISR)
      eclicEnableVector(GD32_TIM5_NUMBER, GD32_ICU_TIM5_IRQ_PRIORITY, GD32_ICU_TIM5_IRQ_TRIGGER);
#endif
#if defined(GD32_TIM5CLK)
      icup->clock = GD32_TIM5CLK;
#else
      icup->clock = GD32_TIMCLK1;
#endif
    }
#endif

#if GD32_ICU_USE_TIM8
    if (&ICUD8 == icup) {
      rccEnableTIM8(true);
      rccResetTIM8();
#if !defined(GD32_TIM8_SUPPRESS_ISR)
      eclicEnableVector(GD32_TIM8_UP_NUMBER, GD32_ICU_TIM8_IRQ_PRIORITY, GD32_ICU_TIM8_IRQ_TRIGGER);
      eclicEnableVector(GD32_TIM8_CC_NUMBER, GD32_ICU_TIM8_IRQ_PRIORITY, GD32_ICU_TIM8_IRQ_TRIGGER);
#endif
#if defined(GD32_TIM8CLK)
      icup->clock = GD32_TIM8CLK;
#else
      icup->clock = GD32_TIMCLK2;
#endif
    }
#endif

#if GD32_ICU_USE_TIM9
    if (&ICUD9 == icup) {
      rccEnableTIM9(true);
      rccResetTIM9();
#if defined(GD32_TIM9CLK)
      icup->clock = GD32_TIM9CLK;
#else
      icup->clock = GD32_TIMCLK2;
#endif
    }
#endif

#if GD32_ICU_USE_TIM10
    if (&ICUD10 == icup) {
      rccEnableTIM10(true);
      rccResetTIM10();
#if defined(GD32_TIM10CLK)
      icup->clock = GD32_TIM10CLK;
#else
      icup->clock = GD32_TIMCLK2;
#endif
    }
#endif

#if GD32_ICU_USE_TIM11
    if (&ICUD11 == icup) {
      rccEnableTIM11(true);
      rccResetTIM11();
#if defined(GD32_TIM11CLK)
      icup->clock = GD32_TIM11CLK;
#else
      icup->clock = GD32_TIMCLK2;
#endif
    }
#endif

#if GD32_ICU_USE_TIM12
    if (&ICUD12 == icup) {
      rccEnableTIM12(true);
      rccResetTIM12();
#if defined(GD32_TIM12CLK)
      icup->clock = GD32_TIM12CLK;
#else
      icup->clock = GD32_TIMCLK1;
#endif
    }
#endif

#if GD32_ICU_USE_TIM13
    if (&ICUD13 == icup) {
      rccEnableTIM13(true);
      rccResetTIM13();
#if defined(GD32_TIM13CLK)
      icup->clock = GD32_TIM13CLK;
#else
      icup->clock = GD32_TIMCLK1;
#endif
    }
#endif

#if GD32_ICU_USE_TIM14
    if (&ICUD14 == icup) {
      rccEnableTIM14(true);
      rccResetTIM14();
#if defined(GD32_TIM14CLK)
      icup->clock = GD32_TIM14CLK;
#else
      icup->clock = GD32_TIMCLK1;
#endif
    }
#endif

#if GD32_ICU_USE_TIM15
    if (&ICUD15 == icup) {
      rccEnableTIM15(true);
      rccResetTIM15();
#if defined(GD32_TIM15CLK)
      icup->clock = GD32_TIM15CLK;
#else
      icup->clock = GD32_TIMCLK2;
#endif
    }
#endif

#if GD32_ICU_USE_TIM20
    if (&ICUD20 == icup) {
      rccEnableTIM20(true);
      rccResetTIM20();
#if defined(GD32_TIM20CLK)
      icup->clock = GD32_TIM20CLK;
#else
      icup->clock = GD32_TIMCLK2;
#endif
    }
#endif

#if GD32_ICU_USE_TIM21
    if (&ICUD21 == icup) {
      rccEnableTIM21(true);
      rccResetTIM21();
#if defined(GD32_TIM21CLK)
      icup->clock = GD32_TIM21CLK;
#else
      icup->clock = GD32_TIMCLK1;
#endif
    }
#endif

#if GD32_ICU_USE_TIM22
    if (&ICUD22 == icup) {
      rccEnableTIM22(true);
      rccResetTIM22();
#if defined(GD32_TIM22CLK)
      icup->clock = GD32_TIM22CLK;
#else
      icup->clock = GD32_TIMCLK1;
#endif
    }
#endif
  }
  else {
    /* Driver re-configuration scenario, it must be stopped first.*/
    icup->tim->CR1    = 0;                  /* Timer disabled.              */
    icup->tim->CCR[0] = 0;                  /* Comparator 1 disabled.       */
    icup->tim->CCR[1] = 0;                  /* Comparator 2 disabled.       */
    icup->tim->CNT    = 0;                  /* Counter reset to zero.       */
  }

  /* Timer configuration.*/
  icup->tim->SR   = 0;                      /* Clear eventual pending IRQs. */
  icup->tim->DIER = icup->config->dier &    /* DMA-related DIER settings.   */
                    ~GD32_TIM_DIER_IRQ_MASK;
  psc = (icup->clock / icup->config->frequency) - 1;
  osalDbgAssert((psc <= 0xFFFF) &&
                ((psc + 1) * icup->config->frequency) == icup->clock,
                "invalid frequency");
  icup->tim->PSC = psc;
  if (icup->config->arr == 0U) {
    /* Zero is an invalid value and is turned in maximum value, also for
       legacy configurations compatibility.*/
    icup->tim->ARR = 0xFFFFFFFFU;
  }
  else {
    icup->tim->ARR = icup->config->arr;
  }

  if (icup->config->channel == ICU_CHANNEL_1) {
    /* Selected input 1.
       CCMR1_CC1S = 01 = CH1 Input on TI1.
       CCMR1_CC2S = 10 = CH2 Input on TI1.*/
    icup->tim->CCMR1 = GD32_TIM_CCMR1_CC1S(1) | GD32_TIM_CCMR1_CC2S(2);

    /* SMCR_TS  = 101, input is TI1FP1.
       SMCR_SMS = 100, reset on rising edge.*/
    icup->tim->SMCR  = GD32_TIM_SMCR_TS(5) | GD32_TIM_SMCR_SMS(4);

    /* The CCER settings depend on the selected trigger mode.
       ICU_INPUT_ACTIVE_HIGH: Active on rising edge, idle on falling edge.
       ICU_INPUT_ACTIVE_LOW:  Active on falling edge, idle on rising edge.*/
    if (icup->config->mode == ICU_INPUT_ACTIVE_HIGH)
      icup->tim->CCER = GD32_TIM_CCER_CC1E |
                        GD32_TIM_CCER_CC2E | GD32_TIM_CCER_CC2P;
    else
      icup->tim->CCER = GD32_TIM_CCER_CC1E | GD32_TIM_CCER_CC1P |
                        GD32_TIM_CCER_CC2E;

