ChibiOS/ChibiOS-Contrib/os/hal/ports/GD/GD32VF103/TIM/hal_icu_lld.c
    /* Direct pointers to the capture registers in order to make reading
       data faster from within callbacks.*/
    icup->wccrp = &icup->tim->CCR[1];
    icup->pccrp = &icup->tim->CCR[0];
  }
  else {
    /* Selected input 2.
       CCMR1_CC1S = 10 = CH1 Input on TI2.
       CCMR1_CC2S = 01 = CH2 Input on TI2.*/
    icup->tim->CCMR1 = GD32_TIM_CCMR1_CC1S(2) | GD32_TIM_CCMR1_CC2S(1);

    /* SMCR_TS  = 110, input is TI2FP2.
       SMCR_SMS = 100, reset on rising edge.*/
    icup->tim->SMCR  = GD32_TIM_SMCR_TS(6) | GD32_TIM_SMCR_SMS(4);

    /* The CCER settings depend on the selected trigger mode.
       ICU_INPUT_ACTIVE_HIGH: Active on rising edge, idle on falling edge.
       ICU_INPUT_ACTIVE_LOW:  Active on falling edge, idle on rising edge.*/
    if (icup->config->mode == ICU_INPUT_ACTIVE_HIGH)
      icup->tim->CCER = GD32_TIM_CCER_CC1E | GD32_TIM_CCER_CC1P |
                        GD32_TIM_CCER_CC2E;
    else
      icup->tim->CCER = GD32_TIM_CCER_CC1E |
                        GD32_TIM_CCER_CC2E | GD32_TIM_CCER_CC2P;

    /* Direct pointers to the capture registers in order to make reading
       data faster from within callbacks.*/
    icup->wccrp = &icup->tim->CCR[0];
    icup->pccrp = &icup->tim->CCR[1];
  }
}

/**
 * @brief   Deactivates the ICU peripheral.
 *
 * @param[in] icup      pointer to the @p ICUDriver object
 *
 * @notapi
 */
void icu_lld_stop(ICUDriver *icup) {

  if (icup->state == ICU_READY) {
    /* Clock deactivation.*/
    icup->tim->CR1  = 0;                    /* Timer disabled.              */
    icup->tim->DIER = 0;                    /* All IRQs disabled.           */
    icup->tim->SR   = 0;                    /* Clear eventual pending IRQs. */

#if GD32_ICU_USE_TIM1
    if (&ICUD1 == icup) {
#if !defined(GD32_TIM1_SUPPRESS_ISR)
      eclicDisableVector(GD32_TIM1_UP_NUMBER);
      eclicDisableVector(GD32_TIM1_CC_NUMBER);
#endif
      rccDisableTIM1();
    }
#endif

#if GD32_ICU_USE_TIM2
    if (&ICUD2 == icup) {
#if !defined(GD32_TIM2_SUPPRESS_ISR)
      eclicDisableVector(GD32_TIM2_NUMBER);
#endif
      rccDisableTIM2();
    }
#endif

#if GD32_ICU_USE_TIM3
    if (&ICUD3 == icup) {
#if !defined(GD32_TIM3_SUPPRESS_ISR)
      eclicDisableVector(GD32_TIM3_NUMBER);
#endif
      rccDisableTIM3();
    }
#endif

#if GD32_ICU_USE_TIM4
    if (&ICUD4 == icup) {
#if !defined(GD32_TIM4_SUPPRESS_ISR)
      eclicDisableVector(GD32_TIM4_NUMBER);
#endif
      rccDisableTIM4();
    }
#endif

#if GD32_ICU_USE_TIM5
    if (&ICUD5 == icup) {
#if !defined(GD32_TIM5_SUPPRESS_ISR)
      eclicDisableVector(GD32_TIM5_NUMBER);
#endif
      rccDisableTIM5();
    }
#endif

#if GD32_ICU_USE_TIM8
    if (&ICUD8 == icup) {
#if !defined(GD32_TIM8_SUPPRESS_ISR)
      eclicDisableVector(GD32_TIM8_UP_NUMBER);
      eclicDisableVector(GD32_TIM8_CC_NUMBER);
#endif
      rccDisableTIM8();
    }
#endif

#if GD32_ICU_USE_TIM9
    if (&ICUD9 == icup) {
      rccDisableTIM9();
    }
#endif

#if GD32_ICU_USE_TIM10
    if (&ICUD10 == icup) {
      rccDisableTIM10();
    }
#endif

#if GD32_ICU_USE_TIM11
    if (&ICUD11 == icup) {
      rccDisableTIM11();
    }
#endif

#if GD32_ICU_USE_TIM12
    if (&ICUD12 == icup) {
      rccDisableTIM12();
    }
#endif

#if GD32_ICU_USE_TIM13
    if (&ICUD13 == icup) {
      rccDisableTIM13();
    }
#endif

#if GD32_ICU_USE_TIM14
    if (&ICUD14 == icup) {
      rccDisableTIM14();
    }
#endif

#if GD32_ICU_USE_TIM15
    if (&ICUD15 == icup) {
      rccDisableTIM15();
    }
#endif

#if GD32_ICU_USE_TIM20
    if (&ICUD20 == icup) {
      rccDisableTIM20();
    }
#endif

#if GD32_ICU_USE_TIM21
    if (&ICUD21 == icup) {
      rccDisableTIM21();
    }
#endif

#if GD32_ICU_USE_TIM22
    if (&ICUD22 == icup) {
      rccDisableTIM22();
    }
#endif
  }
}

/**
 * @brief   Starts the input capture.
 *
 * @param[in] icup      pointer to the @p ICUDriver object
 *
 * @notapi
 */
void icu_lld_start_capture(ICUDriver *icup) {

  /* Triggering an UG and clearing the IRQ status.*/
  icup->tim->EGR |= GD32_TIM_EGR_UG;
  icup->tim->SR = 0;

  /* Timer is started.*/
  icup->tim->CR1 = GD32_TIM_CR1_URS | GD32_TIM_CR1_CEN;
}

/**
 * @brief   Waits for a completed capture.
 * @note    The operation is performed in polled mode.
 * @note    In order to use this function notifications must be disabled.
 *
 * @param[in] icup      pointer to the @p ICUDriver object
 * @return              The capture status.
 * @retval false        if the capture is successful.
 * @retval true         if a timer overflow occurred.
 *
 * @notapi
 */
bool icu_lld_wait_capture(ICUDriver *icup) {

  /* If the driver is still in the ICU_WAITING state then we need to wait
     for the first activation edge.*/
  if (icup->state == ICU_WAITING)
    if (icu_lld_wait_edge(icup))
      return true;

  /* This edge marks the availability of a capture result.*/
  return icu_lld_wait_edge(icup);
}

/**
 * @brief   Stops the input capture.
 *
 * @param[in] icup      pointer to the @p ICUDriver object
 *
 * @notapi
 */
void icu_lld_stop_capture(ICUDriver *icup) {

  /* Timer stopped.*/
  icup->tim->CR1   = 0;

  /* All interrupts disabled.*/
  icup->tim->DIER &= ~GD32_TIM_DIER_IRQ_MASK;
}

/**
 * @brief   Enables notifications.
 * @pre     The ICU unit must have been activated using @p icuStart() and the
 *          capture started using @p icuStartCapture().
 * @note    If the notification is already enabled then the call has no effect.
 *
 * @param[in] icup      pointer to the @p ICUDriver object
 *
 * @notapi
 */
void icu_lld_enable_notifications(ICUDriver *icup) {
  uint32_t dier = icup->tim->DIER;

  /* If interrupts were already enabled then the operation is skipped.
     This is done in order to avoid clearing the SR and risk losing
     pending interrupts.*/
  if ((dier & GD32_TIM_DIER_IRQ_MASK) == 0) {
    /* Previously triggered IRQs are ignored, status cleared.*/
    icup->tim->SR = 0;

    if (icup->config->channel == ICU_CHANNEL_1) {
      /* Enabling periodic callback on CC1.*/
      dier |= GD32_TIM_DIER_CC1IE;

      /* Optionally enabling width callback on CC2.*/
      if (icup->config->width_cb != NULL)
        dier |= GD32_TIM_DIER_CC2IE;
    }
    else {
      /* Enabling periodic callback on CC2.*/
      dier |= GD32_TIM_DIER_CC2IE;

